/*
***************************************Copyright (c)***************************
**                               	  武汉钛联信息技术有限公司
**                                     		工程事业部
**                                        
**
**                                		 
**
**--------------文件信息-------------------------------------------------------
**文   件   名: Flash.h
**创   建   人: 杨开琦
**最后修改日期: 2018年6月4日
**描        述: 内部Flash操作
**              
**--------------历史版本信息---------------------------------------------------
** 创建人: 杨开琦
** 版  本: v1.0
** 日　期: 2018年6月4日
** 描　述: 初始创建
**
**--------------当前版本修订---------------------------------------------------
** 修改人: 
** 日　期: 
** 描　述: 
**
**-----------------------------------------------------------------------------
******************************************************************************/
#ifndef _FLASH_H_
#define _FLASH_H_

#include "stm32f10x.h"

#define FLASH_PAGE_SIZE             ((uint16_t)0x400)        //页大小   - 1K
#define FLASH_TYPE_LENGTH           ((uint16_t)0x002)        //类型大小 - 2字节
#define FLASH_PAGE_LENGTH           (FLASH_PAGE_SIZE/FLASH_TYPE_LENGTH)
#define FLAG_OK                     0x00
#define FLAG_NOOK                   0x01

#define FLASH_PARAM_START_ADDR      0x0801FC00   /* Start @ of user Flash area */
#define FLASH_PARAM_END_ADDR        0x0801FFFF   /* End @ of user Flash area */

/******************************************************************************
** 函数名称: flash_write
** 功能描述: 将数据写入flash
** 入口参数: 要写入的起始地址；要写入的数据头指针；要写入的数据长度(数据单位：16bit)
** 返 回 值: 写入结果：0--失败；1--成功
**
** 作　者: 杨开琦
** 日　期: 2018年6月4日
**-----------------------------------------------------------------------------
******************************************************************************/
uint8_t flash_write(uint32_t address, uint16_t *pdata, uint16_t length);

/******************************************************************************
** 函数名称: flash_read
** 功能描述: 读取flash中的数据
** 入口参数: 要读取的起始地址；保存读取出的数据的头指针；要读取的数据长度(数据单位：16bit)
** 返 回 值: 读取结果：0--失败；1--成功
**
** 作　者: 杨开琦
** 日　期: 2018年6月4日
**-----------------------------------------------------------------------------
******************************************************************************/
uint8_t flash_read(uint32_t address, uint16_t *pdata, uint16_t length);

#endif //_FLASH_H_
