/*********************************************************************************************
* 文件：vibration.c
* 作者：Lixm 2017.10.17
* 说明：震动驱动代码
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "vibration.h"

/*********************************************************************************************
* 名称：vibration_init()
* 功能：震动传感器初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void vibration_init(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
 	
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);	 //使能PA端口时钟
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIOB, &GPIO_InitStructure);}

/*********************************************************************************************
* 名称：unsigned char get_vibration_status(void)
* 功能：获取震动传感器状态
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
unsigned char get_vibration_status(void)
{ 
  if(GPIO_ReadInputDataBit(GPIOB,GPIO_Pin_0))                                                      //振动传感器检测引脚
    return 0;                                                   //没有检测到信号返回 0
  else
    return 1;                                                   //检测到信号返回 1
}