/*********************************************************************************************
* 文件：stepmotor.h
* 作者：zonesion
* 说明：stepmotor头文件
* 修改：Chenkm 2017.01.10 修改代码格式，增加代码注释和文件说明
* 注释：
*********************************************************************************************/
#ifndef STEPMOTOR_H
#define STEPMOTOR_H

/*********************************************************************************************
* 宏定义
*********************************************************************************************/     
#define PIN_STEP         GPIO_Pin_1   
#define PIN_DIR          GPIO_Pin_0
#define PIN_EN 		 GPIO_Pin_3

#define PIN_STEP_port    GPIOB  
#define PIN_DIR_port     GPIOB
#define PIN_EN_port 	 GPIOA

/*********************************************************************************************
* 外部原型函数
*********************************************************************************************/
void stepmotor_init(void);
void reversion(int step);
void forward(int step);
void step(int dir,int steps);

#endif  //STEPMOTOR_H